avr-rust/avrd/packs/atmega/ATmega32C1.atdf
      <value-group caption="" name="ENUM_BOOTSZ">
        <value caption="Boot Flash size=256 words Boot address=$3F00" name="256W_3F00" value="0x03"/>
        <value caption="Boot Flash size=512 words Boot address=$3E00" name="512W_3E00" value="0x02"/>
        <value caption="Boot Flash size=1024 words Boot address=$3C00" name="1024W_3C00" value="0x01"/>
        <value caption="Boot Flash size=2048 words Boot address=$3800" name="2048W_3800" value="0x00"/>
      </value-group>
    </module>
    <module caption="Lockbits" name="LOCKBIT">
      <register-group caption="Lockbits" name="LOCKBIT">
        <register caption="" name="LOCKBIT" offset="0x00" size="1">
          <bitfield caption="Memory Lock" mask="0x03" name="LB" values="ENUM_LB"/>
          <bitfield caption="Boot Loader Protection Mode" mask="0x0C" name="BLB0" values="ENUM_BLB"/>
          <bitfield caption="Boot Loader Protection Mode" mask="0x30" name="BLB1" values="ENUM_BLB2"/>
        </register>
      </register-group>
      <value-group caption="" name="ENUM_LB">
        <value caption="Further programming and verification disabled" name="PROG_VER_DISABLED" value="0x00"/>
        <value caption="Further programming disabled" name="PROG_DISABLED" value="0x02"/>
        <value caption="No memory lock features enabled" name="NO_LOCK" value="0x03"/>
      </value-group>
      <value-group caption="" name="ENUM_BLB">
        <value caption="LPM and SPM prohibited in Application Section" name="LPM_SPM_DISABLE" value="0x00"/>
        <value caption="LPM prohibited in Application Section" name="LPM_DISABLE" value="0x01"/>
        <value caption="SPM prohibited in Application Section" name="SPM_DISABLE" value="0x02"/>
        <value caption="No lock on SPM and LPM in Application Section" name="NO_LOCK" value="0x03"/>
      </value-group>
      <value-group caption="" name="ENUM_BLB2">
        <value caption="LPM and SPM prohibited in Boot Section" name="LPM_SPM_DISABLE" value="0x00"/>
        <value caption="LPM prohibited in Boot Section" name="LPM_DISABLE" value="0x01"/>
        <value caption="SPM prohibited in Boot Section" name="SPM_DISABLE" value="0x02"/>
        <value caption="No lock on SPM and LPM in Boot Section" name="NO_LOCK" value="0x03"/>
      </value-group>
    </module>
    <module caption="I/O Port" name="PORT">
      <register-group caption="I/O Port" name="PORTB">
        <register caption="Port B Data Register" name="PORTB" offset="0x25" size="1" mask="0xFF"/>
        <register caption="Port B Data Direction Register" name="DDRB" offset="0x24" size="1" mask="0xFF"/>
        <register caption="Port B Input Pins" name="PINB" offset="0x23" size="1" mask="0xFF" ocd-rw="R"/>
      </register-group>
      <register-group caption="I/O Port" name="PORTC">
        <register caption="Port C Data Register" name="PORTC" offset="0x28" size="1" mask="0xFF"/>
        <register caption="Port C Data Direction Register" name="DDRC" offset="0x27" size="1" mask="0xFF"/>
        <register caption="Port C Input Pins" name="PINC" offset="0x26" size="1" mask="0xFF" ocd-rw="R"/>
      </register-group>
      <register-group caption="I/O Port" name="PORTD">
        <register caption="Port D Data Register" name="PORTD" offset="0x2B" size="1" mask="0xFF"/>
        <register caption="Port D Data Direction Register" name="DDRD" offset="0x2A" size="1" mask="0xFF"/>
        <register caption="Port D Input Pins" name="PIND" offset="0x29" size="1" mask="0xFF" ocd-rw="R"/>
      </register-group>
      <register-group caption="I/O Port" name="PORTE">
        <register caption="Port E Data Register" name="PORTE" offset="0x2E" size="1" mask="0x07"/>
        <register caption="Port E Data Direction Register" name="DDRE" offset="0x2D" size="1" mask="0x07"/>
        <register caption="Port E Input Pins" name="PINE" offset="0x2C" size="1" mask="0x07" ocd-rw="R"/>
      </register-group>
    </module>
    <module caption="Controller Area Network" name="CAN">
      <register-group caption="Controller Area Network" name="CAN">
        <register caption="CAN General Control Register" name="CANGCON" offset="0xD8" size="1">
          <bitfield caption="Abort Request" mask="0x80" name="ABRQ"/>
          <bitfield caption="Overload Frame Request" mask="0x40" name="OVRQ"/>
          <bitfield caption="Time Trigger Communication" mask="0x20" name="TTC"/>
          <bitfield caption="Synchronization of TTC" mask="0x10" name="SYNTTC"/>
          <bitfield caption="Listening Mode" mask="0x08" name="LISTEN"/>
          <bitfield caption="Test Mode" mask="0x04" name="TEST"/>
          <bitfield caption="Enable / Standby" mask="0x02" name="ENASTB"/>
          <bitfield caption="Software Reset Request" mask="0x01" name="SWRES"/>
        </register>
        <register caption="CAN General Status Register" name="CANGSTA" offset="0xD9" size="1" ocd-rw="R">
          <bitfield caption="Overload Frame Flag" mask="0x40" name="OVFG"/>
          <bitfield caption="Transmitter Busy" mask="0x10" name="TXBSY"/>
          <bitfield caption="Receiver Busy" mask="0x08" name="RXBSY"/>
          <bitfield caption="Enable Flag" mask="0x04" name="ENFG"/>
          <bitfield caption="Bus Off Mode" mask="0x02" name="BOFF"/>
          <bitfield caption="Error Passive Mode" mask="0x01" name="ERRP"/>
        </register>
        <register caption="CAN General Interrupt Register Flags" name="CANGIT" offset="0xDA" size="1">
          <bitfield caption="General Interrupt Flag" mask="0x80" name="CANIT"/>
          <bitfield caption="Bus Off Interrupt Flag" mask="0x40" name="BOFFIT"/>
          <bitfield caption="Overrun CAN Timer Flag" mask="0x20" name="OVRTIM"/>
          <bitfield caption="Burst Receive Interrupt Flag" mask="0x10" name="BXOK"/>
          <bitfield caption="Stuff Error General Flag" mask="0x08" name="SERG"/>
          <bitfield caption="CRC Error General Flag" mask="0x04" name="CERG"/>
          <bitfield caption="Form Error General Flag" mask="0x02" name="FERG"/>
          <bitfield caption="Ackknowledgement Error General Flag" mask="0x01" name="AERG"/>
        </register>
        <register caption="CAN General Interrupt Enable Register" name="CANGIE" offset="0xDB" size="1">
          <bitfield caption="Enable all Interrupts" mask="0x80" name="ENIT"/>
          <bitfield caption="Enable Bus Off Interrupt" mask="0x40" name="ENBOFF"/>
          <bitfield caption="Enable Receive Interrupt" mask="0x20" name="ENRX"/>
          <bitfield caption="Enable Transmitt Interrupt" mask="0x10" name="ENTX"/>
          <bitfield caption="Enable MOb Error Interrupt" mask="0x08" name="ENERR"/>
          <bitfield caption="Enable Burst Receive Interrupt" mask="0x04" name="ENBX"/>
          <bitfield caption="Enable General Error Interrupt" mask="0x02" name="ENERG"/>
          <bitfield caption="Enable CAN Timer Overrun Interrupt" mask="0x01" name="ENOVRT"/>
        </register>
        <register caption="Enable MOb Register 2" name="CANEN2" offset="0xDC" size="1" ocd-rw="R">
          <bitfield caption="Enable MObs" mask="0x3F" name="ENMOB"/>
        </register>
        <register caption="Enable MOb Register 1(empty)" name="CANEN1" offset="0xDD" size="1" mask="0x00" ocd-rw=""/>
        <register caption="Enable Interrupt MOb Register 2" name="CANIE2" offset="0xDE" size="1">
          <bitfield caption="Interrupt Enable  MObs" mask="0x3F" name="IEMOB"/>
        </register>
        <register caption="Enable Interrupt MOb Register 1 (empty)" name="CANIE1" offset="0xDF" size="1" mask="0x00" ocd-rw=""/>
        <register caption="CAN Status Interrupt MOb Register 2" name="CANSIT2" offset="0xE0" size="1" ocd-rw="R">
          <bitfield caption="Status of Interrupt MObs" mask="0x3F" name="SIT"/>
        </register>
