avr-rust/avrd/packs/atmega/ATmega32C1.atdf
    <module caption="Local Interconnect Network" name="LINUART">
      <register-group caption="Local Interconnect Network" name="LINUART">
        <register caption="LIN Control Register" name="LINCR" offset="0xC8" size="1">
          <bitfield caption="Software Reset" mask="0x80" name="LSWRES"/>
          <bitfield caption="LIN Standard" mask="0x40" name="LIN13"/>
          <bitfield caption="LIN Configuration bits" mask="0x30" name="LCONF"/>
          <bitfield caption="LIN or UART Enable" mask="0x08" name="LENA"/>
          <bitfield caption="LIN Command and Mode bits" mask="0x07" name="LCMD"/>
        </register>
        <register caption="LIN Status and Interrupt Register" name="LINSIR" offset="0xC9" size="1">
          <bitfield caption="Identifier Status bits" mask="0xE0" name="LIDST"/>
          <bitfield caption="Busy Signal" mask="0x10" name="LBUSY"/>
          <bitfield caption="Error Interrupt" mask="0x08" name="LERR"/>
          <bitfield caption="Identifier Interrupt" mask="0x04" name="LIDOK"/>
          <bitfield caption="Transmit Performed Interrupt" mask="0x02" name="LTXOK"/>
          <bitfield caption="Receive Performed Interrupt" mask="0x01" name="LRXOK"/>
        </register>
        <register caption="LIN Enable Interrupt Register" name="LINENIR" offset="0xCA" size="1">
          <bitfield caption="Enable Error Interrupt" mask="0x08" name="LENERR"/>
          <bitfield caption="Enable Identifier Interrupt" mask="0x04" name="LENIDOK"/>
          <bitfield caption="Enable Transmit Performed Interrupt" mask="0x02" name="LENTXOK"/>
          <bitfield caption="Enable Receive Performed Interrupt" mask="0x01" name="LENRXOK"/>
        </register>
        <register caption="LIN Error Register" name="LINERR" offset="0xCB" size="1" ocd-rw="R">
          <bitfield caption="Abort Flag" mask="0x80" name="LABORT"/>
          <bitfield caption="Frame Time Out Error Flag" mask="0x40" name="LTOERR"/>
          <bitfield caption="Overrun Error Flag" mask="0x20" name="LOVERR"/>
          <bitfield caption="Framing Error Flag" mask="0x10" name="LFERR"/>
          <bitfield caption="Synchronization Error Flag" mask="0x08" name="LSERR"/>
          <bitfield caption="Parity Error Flag" mask="0x04" name="LPERR"/>
          <bitfield caption="Checksum Error Flag" mask="0x02" name="LCERR"/>
          <bitfield caption="Bit Error Flag" mask="0x01" name="LBERR"/>
        </register>
        <register caption="LIN Bit Timing Register" name="LINBTR" offset="0xCC" size="1">
          <bitfield caption="Disable Bit Timing Resynchronization" mask="0x80" name="LDISR"/>
          <bitfield caption="LIN Bit Timing bits" mask="0x3F" name="LBT"/>
        </register>
        <register caption="LIN Baud Rate Register" name="LINBRR" offset="0xCD" size="2">
          <bitfield caption="" mask="0x0FFF" name="LDIV"/>
        </register>
        <register caption="LIN Data Length Register" name="LINDLR" offset="0xCF" size="1">
          <bitfield caption="LIN Transmit Data Length bits" mask="0xF0" name="LTXDL"/>
          <bitfield caption="LIN Receive Data Length bits" mask="0x0F" name="LRXDL"/>
        </register>
        <register caption="LIN Identifier Register" name="LINIDR" offset="0xD0" size="1">
          <bitfield caption="Parity bits" mask="0xC0" name="LP"/>
          <bitfield caption="Identifier bit 5 or Data Length bits" mask="0x3F" name="LID"/>
        </register>
        <register caption="LIN Data Buffer Selection Register" name="LINSEL" offset="0xD1" size="1">
          <bitfield caption="Auto Increment of Data Buffer Index (Active Low)" mask="0x08" name="LAINC"/>
          <bitfield caption="FIFO LIN Data Buffer Index bits" mask="0x07" name="LINDX"/>
        </register>
        <register caption="LIN Data Register" name="LINDAT" offset="0xD2" size="1">
          <bitfield caption="" mask="0xFF" name="LDATA"/>
        </register>
      </register-group>
    </module>
    <module caption="Serial Peripheral Interface" name="SPI">
      <register-group caption="Serial Peripheral Interface" name="SPI">
        <register caption="SPI Control Register" name="SPCR" offset="0x4C" size="1">
          <bitfield caption="SPI Interrupt Enable" mask="0x80" name="SPIE"/>
          <bitfield caption="SPI Enable" mask="0x40" name="SPE"/>
          <bitfield caption="Data Order" mask="0x20" name="DORD"/>
          <bitfield caption="Master/Slave Select" mask="0x10" name="MSTR"/>
          <bitfield caption="Clock polarity" mask="0x08" name="CPOL"/>
          <bitfield caption="Clock Phase" mask="0x04" name="CPHA"/>
          <bitfield caption="SPI Clock Rate Selects" mask="0x03" name="SPR" values="COMM_SCK_RATE_3BIT"/>
        </register>
        <register caption="SPI Status Register" name="SPSR" offset="0x4D" size="1" ocd-rw="R">
          <bitfield caption="SPI Interrupt Flag" mask="0x80" name="SPIF"/>
          <bitfield caption="Write Collision Flag" mask="0x40" name="WCOL"/>
          <bitfield caption="Double SPI Speed Bit" mask="0x01" name="SPI2X"/>
        </register>
        <register caption="SPI Data Register" name="SPDR" offset="0x4E" size="1" mask="0xFF" ocd-rw="">
          <bitfield caption="SPI Data bits" mask="0xFF" name="SPDR"/>
        </register>
      </register-group>
      <value-group caption="" name="COMM_SCK_RATE_3BIT">
        <value caption="fosc/4" name="VAL_0x00" value="0x00"/>
        <value caption="fosc/16" name="VAL_0x01" value="0x01"/>
        <value caption="fosc/64" name="VAL_0x02" value="0x02"/>
        <value caption="fosc/128" name="VAL_0x03" value="0x03"/>
        <value caption="fosc/2" name="VAL_0x04" value="0x04"/>
        <value caption="fosc/8" name="VAL_0x05" value="0x05"/>
        <value caption="fosc/32" name="VAL_0x06" value="0x06"/>
        <value caption="fosc/64" name="VAL_0x07" value="0x07"/>
      </value-group>
    </module>
    <module caption="Watchdog Timer" name="WDT">
      <register-group caption="Watchdog Timer" name="WDT">
        <register caption="Watchdog Timer Control Register" name="WDTCSR" offset="0x60" size="1" ocd-rw="R">
          <bitfield caption="Watchdog Timeout Interrupt Flag" mask="0x80" name="WDIF"/>
          <bitfield caption="Watchdog Timeout Interrupt Enable" mask="0x40" name="WDIE"/>
          <bitfield caption="Watchdog Timer Prescaler Bits" mask="0x27" name="WDP" values="WDOG_TIMER_PRESCALE_4BITS"/>
          <bitfield caption="Watchdog Change Enable" mask="0x10" name="WDCE"/>
          <bitfield caption="Watch Dog Enable" mask="0x08" name="WDE"/>
        </register>
      </register-group>
